import React from 'react';

import './index.less';

const Alphabetize: React.FC<{
  data: any;
}> = (props) => {
  const data = [
    {
      class: 'A',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
    {
      class: 'B',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
    {
      class: 'C',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
    {
      class: 'D',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
    {
      class: 'E',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
    {
      class: 'F',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
    {
      class: 'G',
      value: [
        '功能名称功能功能名1',
        '功能名称功能功能名2',
        '功能名称功能功能名3',
        '功能名称功能功能名4',
        '功能名称功能功能名5',
        '功能名称功能功能名6',
        '功能名称功能功能名7',
        '功能名称功能功能名8',
        '功能名称功能功能名9',
        '功能名称功能功能名10',
      ],
    },
  ];

  console.log(props, data);

  return <div className="alphabetize-wrap">mmgmg</div>;
};

export default Alphabetize;
